In [ ]:
ADVANTAGES
- It works really with clear margin of seperation
- It is effective in high dimensional spaces.
- It is effective in cases where number od dimensions is greater than the number of samples
- It uses a subset of training points in the secision function (called support vectors), so it is also memory efficient.

Importing the libraries

In [19]:
import pandas as pd
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix

In [3]:
df=pd.read_csv('SVMtrain.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,Male,22.0,1,0,7.2500,3
1,2,1,1,female,38.0,1,0,71.2833,1
2,3,1,3,female,26.0,0,0,7.9250,3
3,4,1,1,female,35.0,1,0,53.1000,3
4,5,0,3,Male,35.0,0,0,8.0500,3

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked'],
      dtype='object')

In [9]:
df1=df.drop(['PassengerId'],axis=1)

In [11]:
df1.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    Male  22.0      1      0   7.2500         3
1         1       1  female  38.0      1      0  71.2833         1
2         1       3  female  26.0      0      0   7.9250         3
3         1       1  female  35.0      1      0  53.1000         3
4         0       3    Male  35.0      0      0   8.0500         3

In [20]:
le=preprocessing.LabelEncoder()
le.fit(df1['Sex'])
LabelEncoder()
print(le.classes_)

['Male' 'female']

In [21]:
df1['Sex']=le.transform(df1['Sex'])

In [22]:
df1.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500         3
1         1       1    1  38.0      1      0  71.2833         1
2         1       3    1  26.0      0      0   7.9250         3
3         1       1    1  35.0      1      0  53.1000         3
4         0       3    0  35.0      0      0   8.0500         3

In [27]:
y=df1['Survived']
x=df1.drop(['Survived'],axis=1)
x.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    0  22.0      1      0   7.2500         3
1       1    1  38.0      1      0  71.2833         1
2       3    1  26.0      0      0   7.9250         3
3       1    1  35.0      1      0  53.1000         3
4       3    0  35.0      0      0   8.0500         3

In [28]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)
x_train.head()

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
350       1    0  60.0      0      0  35.0000         3
124       3    0  12.0      1      0  11.2417         1
577       3    1  60.0      1      0  14.4583         1
422       3    1  28.0      1      1  14.4000         3
118       3    1   2.0      4      2  31.2750         3

In [29]:
x_test.head()

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
14        3    1  14.0      0      0    7.8542         3
158       3    0  60.0      8      2   69.5500         3
762       1    1  36.0      1      2  120.0000         3
740       1    0  36.0      1      0   78.8500         3
482       3    1  63.0      0      0    9.5875         3

In [30]:
from sklearn import svm

In [31]:
clf=svm.SVC(gamma=0.001,C=100)
clf.fit(x_train,y_train)

SVC(C=100, gamma=0.001)

In [32]:
y_pred=clf.predict(x_test)

In [33]:
accuracy_score(y_test,y_pred,normalize=True)

0.7602996254681648

In [34]:
confusion_matrix(y_test,y_pred)

array([[124,  33],
       [ 31,  79]], dtype=int64)

In [35]:
y=df1['Pclass']
x=df1.drop(['Pclass'],axis=1)
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)
x_train.head()

     Survived  Sex   Age  SibSp  Parch     Fare  Embarked
350         0    0  60.0      0      0  35.0000         3
124         1    0  12.0      1      0  11.2417         1
577         0    1  60.0      1      0  14.4583         1
422         0    1  28.0      1      1  14.4000         3
118         0    1   2.0      4      2  31.2750         3

In [36]:
x_test.head()

     Survived  Sex   Age  SibSp  Parch      Fare  Embarked
14          0    1  14.0      0      0    7.8542         3
158         0    0  60.0      8      2   69.5500         3
762         1    1  36.0      1      2  120.0000         3
740         0    0  36.0      1      0   78.8500         3
482         1    1  63.0      0      0    9.5875         3

In [37]:
clf=svm.SVC(gamma=0.001,C=100)
clf.fit(x_train,y_train)

SVC(C=100, gamma=0.001)

In [38]:
y_pred=clf.predict(x_test)

In [39]:
accuracy_score(y_test,y_pred,normalize=True)

0.8651685393258427

In [40]:
confusion_matrix(y_test,y_pred)

array([[ 68,   2,   0],
       [  8,  29,  12],
       [  6,   8, 134]], dtype=int64)